app/controllers/add_controller.rb

INSERT INTO "products" ("nombre", "tipo", "codigo", "stock", "precio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nombre", "papa"], ["tipo", "comida"], ["codigo", 349853], ["stock", 20], ["precio", 400], ["created_at", "2020-07-20 02:24:15.095301"], ["updated_at", "2020-07-20 02:24:15.095301"]]
---
  def metodoadd
  	@nombre = params[:name]
  	@stock = params[:stock]
  	@codigo = params[:code]
  	@precio = params[:price]
  	@tipo = params[:type]

  	@producto = Product.create({nombre: @nombre, tipo: @tipo, codigo: @codigo, stock: @stock, precio: @precio})